{
  "processes": [
    {
      "title": "Wie flexibel ist Ihre Anforderungsaufnahme?",
      "cite": "Hier fehlt Quelle!",
      "answers": [
        {"score": 0, "text": "Anforderungen werden während des Projekts ad-hoc und ohne festgelegte Prozesse aufgenommen."},
        {"score": 1, "text": "Anforderungen werden während des Projekts nach einem festgelegten Verfahren aufgenommen, um sicherzustellen, dass alle relevanten Informationen berücksichtigt werden."},
        {"score": 2, "text": "Anforderungen werden während des Projekts nach einem festgelegten und dokumentierten Verfahren aufgenommen, um sicherzustellen, dass alle Beteiligten dasselbe Verständnis davon haben, wie Anforderungen aufgenommen werden."},
        {"score": 3, "text": "Anforderungen werden während des Projekts nach einem festgelegten und bewährten Verfahren aufgenommen, das im Team gut verstanden und angewendet wird."},
        {"score": 4, "text": "Anforderungen werden während des Projekts nach einem festgelegten und ständig verbesserten Verfahren aufgenommen, das das Projektziel unterstützt und die Zufriedenheit des Kunden sicherstellt."}
      ],
      "choice": -1
    },
    {
      "title": "Finden in den Teams tagliche, kurze Besprechung zur Entwicklung (Dailys) statt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es findet kaum Austausch im Entwicklerteam statt (jeder Arbeitet für sich an seinen Aufgaben)."},
        {"score": 1, "text": "Das gesamte Entwicklerteam hat die Möglichkeit sich untereinander abzustimmen."},
        {"score": 2, "text": "Es gibt einen festgelegten Rahmen zur regelmäßigen Besprechung (bsp. wöchentlich)."},
        {"score": 3, "text": "Es finden jeden Tag zu festgelegter Uhrzeit im kompletten Team Dailys statt."},
        {"score": 4, "text": "Es finden jeden Tag zu festgelegter Uhrzeit im  Team Dailys statt. Es wird auf eine kurze Dauer und Effektivität geachtet."}
      ],
      "choice": -1
    },
    {
      "title": "Wie stark ist das Testen der Software im Entwicklungsprozess integriert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Neue Features sowie die allgemeine Funktion der SW werden nicht getestet."},
        {"score": 1, "text": "Neue Features sowie allgemeine Funktionen werden hin und wieder überprüft."},
        {"score": 2, "text": "Es gibt klare Vorgaben zu Softwaretests, welche von einem Testteam berücksichtigt werden."},
        {"score": 3, "text": "Die Verantwortung der Softwaretests liegt im gesamten Entwicklerteam. Jeder befolgt klare Vorgaben."},
        {"score": 4, "text": "Das gesamte Entwicklerteam sorgt für regelmäßiges und zeitnahes Testen vor der Auslieferung einer Funktion."}
      ],
      "choice": -1
    },
    {
      "title": "Wie lässt sich die Übersicht der aktuellen Tasks im Team beschreiben?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Übersicht wer an was entwickelt."},
        {"score": 1, "text": "Die Entwickler tauschen sich unregelmäßig aus wer an was arbeitet."},
        {"score": 2, "text": "Die Entwickler tauschen sich regelmäßig aus wer an was arbeitet."},
        {"score": 3, "text": "Die Entwickler haben eine konkrete Übersicht der Tasks und aktualisieren wer was bearbeitet."},
        {"score": 4, "text": "Die Entwickler haben eine detaillierte Übersicht der Tasks und verschiedene Status der Bearbeitung. Stetig aktualisiert."}
      ],
      "choice": -1
    },
    {
      "title": "Wie sehr sind die Stakeholder durch Demonstrationen des Softwarestandes im Entwicklungsprozess involviert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Die Software wird am Ende ausgeliefert und nicht extra demonstriert."},
        {"score": 1, "text": "Die Software wird am Ende ausgeliefert und sorgfältig demonstriert."},
        {"score": 2, "text": "Die Software wird auf Anfrage dem Kunden auch während der Entwicklungsphase demonstriert."},
        {"score": 3, "text": "Die Software wird regelmäßig (festgelegt) dem Kunden demonstriert."},
        {"score": 4, "text": "Die Software wird regelmäßig allen Stakeholdern (inkl. allen Entwicklern) demonstriert und feedback wird eingeholt."}
      ],
      "choice": -1
    },
    {
      "title": "Wie häufig wird bestehender Code im laufe des Projekts überarbeitet und verbessert?",
      "cite": "https://link.springer.com/book/10.1007/978-3-658-33395-9",
      "answers": [
        {"score": 0, "text": "Der Quellcode und dessen Dokumentation werden nicht überarbeitet."},
        {"score": 1, "text": "Der Quellcode und dessen Dokumentation werden teilweise und selten überarbeitet."},
        {"score": 2, "text": "Der Quellcode und dessen Dokumentation werden selten überarbeitet."},
        {"score": 3, "text": "Der Quellcode und dessen Dokumentation werden öfter überarbeitet."},
        {"score": 4, "text": "Der Quellcode und dessen Dokumentation werden regelmassig überarbeitet."}
      ],
      "choice": -1
    },
    {
      "title": "Wird neuer Code durch andere Entwicklungspersonen überprüft und validiert?",
      "cite": "https://link.springer.com/book/10.1007/978-3-658-33395-9",
      "answers": [
        {"score": 0, "text": "Neue Codeabschnitte und alle Codeänderung werden nicht überprüft."},
        {"score": 1, "text": "Neue Codeabschnitte und alle Codeänderung werden selten überprüft."},
        {"score": 2, "text": "Neue Codeabschnitte und alle Codeänderung werden öfter überprüft."},
        {"score": 3, "text": "Neue Codeabschnitte und alle Codeänderung werden mindestens durch eine Person überprüft."},
        {"score": 4, "text": "Neue Codeabschnitte und alle Codeänderung werden mindestens durch eine qualifizierte Person überprüft."}
      ],
      "choice": -1
    }
  ],
  "organisation": [
    {
      "title": "Wird ein Agile Transition Team gewinnbringend eingesetzt?",
      "cite": "Schwaber, K., & Beedle, M. (2002). Agile Software Development with Scrum. Prentice Hall",
      "answers": [
        {"score": 0, "text": "Es gibt ein dediziertes Team, das sich ausschließlich mit der Einführung agiler Methoden und Prozesse im Unternehmen befasst."},
        {"score": 1, "text": "Das Unternehmen/Abteilung verfügt über ein Team, welches sich mit der Einführung und Umsetzung agiler Methoden und Prozesse befasst, und  zudem klare Ziele und Verantwortlichkeiten hat."},
        {"score": 2, "text": "Die Ziele und Verantwortlichkeiten des Agile Transition Teams sind im Unternehmen festgelegt und dokumentiert und werden regelmäßig überprüft und gegebenenfalls angepasst."},
        {"score": 3, "text": "Das Agile Transition Team ist im Unternehmen gut ausgebildet und erfahren und kann daher die Einführung agiler Methoden und Prozesse erfolgreich vorantreiben und Schwierigkeiten schnell und effektiv lösen."},
        {"score": 4, "text": "Das Agile Transition Team führt im Unternehmen regelmäßige Retrospektiven durch, um die Einführung agiler Methoden und Prozesse kontinuierlich zu verbessern und zu optimieren."}
      ],
      "choice": -1
    },
    {
      "title": "Wird ein Agile Coach in der Abteilung gewinnbringend eingesetzt?",
      "cite": "Highsmith, J. (2002). Agile Software Development Ecosystems. Addison-Wesley",
      "answers": [
        {"score": 0, "text": "Das Unternehmen/Abteilung verfügt über einen dedizierten Agile Coach, der das Unternehmen bei der Einführung agiler Methoden und Prozesse unterstützt."},
        {"score": 1, "text": "Das Unternehmen verfügt über einen Agile Coach, der das Unternehmen bei der Einführung und Umsetzung agiler Methoden und Prozesse unterstützt und  zudem klare Ziele und Verantwortlichkeiten hat."},
        {"score": 2, "text": "Die Ziele und Verantwortlichkeiten des Agile Coaches sind im Unternehmen festgelegt und dokumentiert und werden regelmäßig überprüft und gegebenenfalls angepasst."},
        {"score": 3, "text": "Der Agile Coach ist im Unternehmen gut ausgebildet und erfahren und kann daher das Unternehmen erfolgreich bei der Einführung agiler Methoden und Prozesse unterstützen und Schwierigkeiten schnell und effektiv lösen."},
        {"score": 4, "text": "Der Agile Coach führt im Unternehmen regelmäßige Retrospektiven durch, um die Einführung agiler Methoden und Prozesse kontinuierlich zu verbessern und zu optimieren."}
      ],
      "choice": -1
    },
    {
      "title": "Existiert eine priorisierte Übersicht aller Produktanforderungen?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gib eine Übersicht aller Kundenanforderungen."},
        {"score": 1, "text": "Die Kundenanforderungen werden zu Beginn in konkrete Entwicklungsaufgaben überführt (Übersicht vorhanden)."},
        {"score": 2, "text": "Die Aufgaben werden regelmäßig von/mit Entwicklern in Aufgaben formuliert."},
        {"score": 3, "text": "Es gibt einen Product Owner, der die Aufgaben pflegt und die Übersicht aktuell hält."},
        {"score": 4, "text": "Es gibt einen Product Owner, der die Aufgaben täglich pflegt, kategorisiert, priorisiert und mit Entwicklern abstimmt."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Kick-Off-Workshops zum Sammeln der Anforderung (alle Stakeholder) durchgeführt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es findet keinerlei interaktiver Kundenaustausch zu Anforderungen statt"},
        {"score": 1, "text": "Die Anforderungen kommen vom Kunden und werden teilweise zur Diskussion gestellt (hin und her Kommunikation)."},
        {"score": 2, "text": "Ausgewählte Personen des Projekts führen Austausch mit Kunden zu Anforderungen durch."},
        {"score": 3, "text": "Zu Beginn findet ein Workshop aller Beteiligten statt, um die Anforderungen vollständig festzulegen."},
        {"score": 4, "text": "Zu Beginn findet mit allen Stakeholdern ein Workshop statt. Ergebnisse werden festgehalten. Jedoch für grundlegende Veränderungen offen."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Rollen in Projekten klar definiert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt kein klar abgrenzbares Entwicklerteam."},
        {"score": 1, "text": "Das Projektteam besteht aus definierten Personen, keine klaren Rollen, jeder macht alles."},
        {"score": 2, "text": "Das Projektteam besteht aus definierten Personen, einige haben Spezialgebiet."},
        {"score": 3, "text": "Das Projektteam enthält klare Rollen, werden nicht vollständig besetzt/durchgezogen."},
        {"score": 4, "text": "Das Team besteht aus klaren Rollen, jede Rolle ist ausreichend besetzt und vertretbar, niemand muss springen."}
      ],
      "choice": -1
    },
    {
      "title": "Werden User Stories ausformuliert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "User Stories werden nicht oder nur sporadisch benutzt."},
        {"score": 1, "text": "User Stories werden genutzt, enthalten aber nur grobe Anforderungen."},
        {"score": 2, "text": "User Stories sind detaillierter und enthalten spezifische Anforderungen zum Produkt."},
        {"score": 3, "text": "User Stories werden regelmäßig erstellt und überprüft, um die Qualität sicherzustellen."},
        {"score": 4, "text": "User Stories sind umfassend und ausreichend geprüft und dienen zur Kommunikation und Planung gemeinsam mit dem Kunden."}
      ],
      "choice": -1
    },
    {
      "title": "Existieren bereichsübergreifende Teams (z.B. aus Devs, Designern, Business, etc.)?",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Das Projektteam hat keine klaren Bereichsdefinitionen (einzelne Personen arbeiten interdisziplinär)."},
        {"score": 1, "text": "Das Team besteht hauptsächlich aus Entwicklern, andere Bereiche arbeiten ihm zu."},
        {"score": 2, "text": "Das Team besteht hauptsächlich aus Entwicklern, bestimmte Spezialisten stehen zur Verfügung."},
        {"score": 3, "text": "Das Team besteht aus interdisziplinären Teilen (Devs, Designer,…) vereinzelt werden Spezialisten herangezogen"},
        {"score": 4, "text": "Das Team besteht vollständig aus interdisziplinären Teilen (alles abgedeckt)."}
      ],
      "choice": -1
    },
    {
      "title": "Wird das Prinzip des Pair-Programmings angewendet?",
      "cite": ["https://link.springer.com/book/10.1007/978-3-658-33395-9", "https://mediatum.ub.tum.de/doc/1094277/file.pdf"],
      "answers": [
        {"score": 0, "text": "Die Programierer arbeiten allein und somit findet kein Pair-Programming statt."},
        {"score": 1, "text": "Das Pair-Programming wird nur für neue Mitarbeiter angewendet."},
        {"score": 2, "text": "Die Programmierer arbeiten hauptsächlich allein. Bei den schwierigen Aufgaben wenden sich die Mitarbeiter gelegentlich an den Experten für ein Pair-Programming."},
        {"score": 3, "text": "Das Pair-Programming findet regelmäßig mit festen Terminen zwischen zwei Team-Mitgliedern statt."},
        {"score": 4, "text": "Mindestens zwei Team-Mitglieder arbeiten eng zusammen und tauschen sich öfter beim Pair-Programming ihr Wissen aus."}
      ],
      "choice": -1
    }
  ],
  "technology": [
    {
      "title": "Werden Aufgabenmanagement Tools für die Entwicklung verwendet?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Es werden keine Aufgabenmanagment Tools benutzt."},
        {"score": 1, "text": "Aufgabenmanagment Tools werden nur selten benutzt."},
        {"score": 2, "text": "Aufgabenmanagment Tools werden hauptsächlich für die Aufgabenverteilung benutzt."},
        {"score": 3, "text": "Aufgabenmanagment Tools werden auschließlich für die Aufgabenverteilung genutzt."},
        {"score": 4, "text": "Aufgabenmanagment Tools werden auschließlich für die Aufgabenverteilung genutzt und alle Auswertungsstatistiken werden benutzt."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Kommunikationstools wie Teams, Zoom, Slack, etc. verwendet?)",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Verfügt das Unternehmen über geeignete Kommunikationstools, die es den Mitarbeitern ermöglichen, im Rahmen der agilen Softwareentwicklung miteinander zu kommunizieren?"},
        {"score": 1, "text": "Sind die Kommunikationstools im Unternehmen für die agilen Methoden und Prozesse geeignet und werden sie von den Mitarbeitern aktiv genutzt, um im Rahmen der agilen Softwareentwicklung zu kommunizieren?"},
        {"score": 2, "text": "Sind die Kommunikationstools im Unternehmen für die agilen Methoden und Prozesse standardisiert und werden sie von allen Teams im Unternehmen einheitlich genutzt, um im Rahmen der agilen Softwareentwicklung zu kommunizieren?"},
        {"score": 3, "text": "Sind die Kommunikationstools im Unternehmen für die agilen Methoden und Prozesse gut bekannt und werden sie von allen Mitarbeitern im Unternehmen sicher und effektiv genutzt, um im Rahmen der agilen Softwareentwicklung zu kommunizieren?"},
        {"score": 4, "text": "Führt das Unternehmen regelmäßig Reviews der Kommunikationstools durch, um sicherzustellen, dass sie immer noch für die agilen Methoden und Prozesse geeignet sind und von allen Mitarbeitern effektiv genutzt werden?"}
      ],
      "choice": -1
    },
    {
      "title": "Werden Zeiterfassungstools, um den Entwicklungsprozess zu kontrollieren?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Es werden keine Zeiterfassungstools genutzt."},
        {"score": 1, "text": "Es werden Zeiterfassungstools regelmäßig und zielgerichtet genutzt."},
        {"score": 2, "text": "Es werden Zeiterfassungstools standardisiert und in allen Projekten eingesetzt."},
        {"score": 3, "text": "Es werden Zeiterfassungstools effektiv und effizient genutzt, um die Entwicklung zu optimieren und zu verbessern."},
        {"score": 4, "text": "Es werden Zeiterfassungstools kontinuierlich weiterentwickelt und angepasst, um die besten Ergebnisse zu erzielen."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Feedback Tools verwendet?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Es werden keine Feedback Tools verwendet."},
        {"score": 1, "text": "Feedback Tools sind vorhanden, werden aber nicht ausgewertet oder genutzt."},
        {"score": 2, "text": "Feedback Tools sind vorhanden, werden sporadisch ausgewertet und umgesetzt."},
        {"score": 3, "text": "Feedback Tools sind vorhanden, werden genutzt und umgesetzt"},
        {"score": 4, "text": "Feedback Tools werden verwendet, besprochen und zügig umgesetzt."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Online Workshops zur Weiterbildung angeboten?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Es werden keine Online-Workshops angeboten"},
        {"score": 1, "text": "Es werden Online-Workshops regelmäßig und zielgerichtet genutzt."},
        {"score": 2, "text": "Es werden Online-Workshops standardisiert und in allen Projekten eingesetzt."},
        {"score": 3, "text": "Es werden Online-Workshops effektiv und effizient genutzt, um die Entwicklung zu optimieren und zu verbessern."},
        {"score": 4, "text": "Es werden Online-Workshops kontinuierlich weiterentwickelt und angepasst, um die besten Ergebnisse zu erzielen."}
      ],
      "choice": -1
    }
  ],
  "skills_culture": [
    {
      "title": "Wird das agile Mindset genutzt?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Die Mitglieder des Entwicklungsteams haben ein grundlegendes Verständnis von agilen Werte- und Prinzipien."},
        {"score": 1, "text": "Die Mitglieder des Entwicklungsteams setzen agile Werte und Prinzipien bewusst in ihrem täglichen Arbeitsalltag um."},
        {"score": 2, "text": "Das agile Mindset im gesamten Unternehmen wird  gelebt und unterstützt, inklusive Führungsebene."},
        {"score": 3, "text": "Die Mitglieder des Entwicklungsteams nutzen ihr agiles Mindset, um kontinuierlich ihre Arbeitsweisen zu verbessern und Anpassungen vorzunehmen."},
        {"score": 4, "text": "Das agile Mindset wird proaktiv genutzt, um neue Geschäftsmöglichkeiten zu identifizieren und zu nutzen sowie den Wertbeitrag des Entwicklungsteams zu maximieren."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Schulungen zur agilen Softwareentwicklung benutzt?",
      "cite": "",
      "answers": [
        {"score": 0, "text": "Das Unternehmen bietet Schulungen zur agilen Softwareentwicklung für seine Mitarbeiter an, um ihre Fähigkeiten in diesem Bereich zu verbessern"},
        {"score": 1, "text": "Schulungen wurden zur agilen Softwareentwicklung bereits in das Weiterbildungsprogramm des Unternehmens aufgenommen und in regelmäßigen Abständen angeboten."},
        {"score": 2, "text": "Schulungen werden zur agilen Softwareentwicklung für alle Mitarbeiter des Unternehmens verpflichtend angeboten, um ein einheitliches Verständnis und Wissen in diesem Bereich zu gewährleisten."},
        {"score": 3, "text": "Schulungen werden zur agilen Softwareentwicklung regelmäßig von erfahrenen Mitarbeitern des Unternehmens geleitet und auf individuelle Bedürfnisse der Teilnehmer abgestimmt."},
        {"score": 4, "text": "Schulungen werden zur agilen Softwareentwicklung regelmäßig evaluiert und angepasst, um sicherzustellen, dass sie den aktuellen Bedürfnissen und Anforderungen des Unternehmens entsprechen."}
      ],
      "choice": -1
    },
    {
      "title": "Wie werden Unternehmensziele in Projektteams formuliert und zusammengeführt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Unternehmensziele werden außerhalb des Projektteams bestimmt."},
        {"score": 1, "text": "Unternehmensziele werden außerhalb definiert, jeder hat überblick und kann Kritik üben"},
        {"score": 2, "text": "Unternehmensziele werden mit Projektteams besprochen + Diskussionen."},
        {"score": 3, "text": "Unternehmensziele werden zsm mit Projektteams formuliert."},
        {"score": 4, "text": "Unternehmensziele werden ausschließlich in Projektteams formuliert und zusammengeführt."}
      ],
      "choice": -1
    },
    {
      "title": "Werden Probleme und Änderungswünsche im Unternehmen berücksichtigt und diskutiert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Die Unternehmenskultur ist nicht veränderbar."},
        {"score": 1, "text": "Manche Mitarbeitenden haben Einfluss auf Veränderung im Unternehmen."},
        {"score": 2, "text": "Es gibt Möglichkeiten zur Kommunikation bei Problemen und Änderungswünschen."},
        {"score": 3, "text": "Es gibt für jeden Mitarbeitenden die gleichen Möglichkeiten Probleme und Änderungswünsche offen zu kommunizieren."},
        {"score": 4, "text": "Probleme und Änderungswünsche werden umgehend berücksichtigt und diskutiert."}
      ],
      "choice": -1
    },
    {
      "title": "Werden die Probleme und Konfilikte im Unternehmen diskutiert?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Struktur zur Problembesprechung."},
        {"score": 1, "text": "Probleme können offen geäußert werden."},
        {"score": 2, "text": "Probleme können offen geäußert werden. Es gibt Abläufe zur Berücksichtigung dieser."},
        {"score": 3, "text": "Es gibt im Projektteam eine ausgewiesene Person zur Besprechung von Konflikten im Team."},
        {"score": 4, "text": "Es finden regelmäßige Retrospektiven zur Besprechung von Abläufen, Konflikten und dem Entwicklungsprozess statt. Von unabhängigem moderiert."}
      ],
      "choice": -1
    },{
      "title": "Steht Weiterbildungsmöglichkeiten für die Mitarbeiter zur Verfügung?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Möglichkeiten zur Weiterbildung."},
        {"score": 1, "text": "Mitarbeiter müssen sich selbst um Weiterbildungsoptionen kümmern."},
        {"score": 2, "text": "Vereinzelt werden Weiterbildungen für Mitarbeite angeboten."},
        {"score": 3, "text": "Mitarbeiter haben in ihren Bereichen Weiterbildungsoptionen."},
        {"score": 4, "text": "Jeder Mitarbeiter hat ständige Möglichkeiten sich in allen Bereichen weiterzubilden."}
      ],
      "choice": -1
    },
    {
      "title": "Wie wird Arbeitsgeschwindigkeit im Unternehmen geregelt?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können ihre Arbeitsgeschwindigkeit durchgängig und stabil halten."},
        {"score": 1, "text": "Ressourcen und Kapazitäten werden im Team gut geplant und eingesetzt, um die Arbeitsgeschwindigkeit zu stabilisieren."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um die konstante Arbeitsgeschwindigkeit zu ermöglichen."},
        {"score": 3, "text": "Regelmäßige werden Retrospektiven durchgeführt, um Schwankungen in der Arbeitsgeschwindigkeit zu identifizieren und zu beheben."},
        {"score": 4, "text": "Teams führen kontinuierliche Experimente und Anpassungen an ihren Prozessen und Arbeitsabläufen durch, um die Konstante Arbeitsgeschwindigkeit zu verbessern."}
      ],
      "choice": -1
    },
    {
      "title": "Wie wird Selbstorganisations der Teams geregelt?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können ihre Arbeitsaufgaben selbstständig planen und priorisieren."},
        {"score": 1, "text": "Klare Verantwortlichkeiten und Entscheidungsbefugnisse werden innerhalb der Teams festgelegt."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert."},
        {"score": 3, "text": "Regelmäßige  werden Retrospektiven durchgeführt, um die Selbstorganisation im Team zu verbessern."},
        {"score": 4, "text": "Teams führen kontinuierliche Experimente und Anpassungen an ihren Prozessen und Arbeitsabläufen durch, um die Selbstorganisation zu verbessern."}
      ],
      "choice": -1
    },
    {
      "title": "Kommunizieren Mitarbeiter offen und werden durch Führungskraft unterstützt und gefördert?",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Keine Kommunikation zwischen Mitarbeitern und Führungskräften."},
        {"score": 1, "text": "Nötigste Kommunikation zwischen Mitarbeitern und Führungskräften."},
        {"score": 2, "text": "Kommunikation zwischen Mitarbeitern und Führungskräften ist in normalen Maß."},
        {"score": 3, "text": "Kommunikation zwischen Mitarbeitern und Führungskräften ist in normalen Maß; Mitarbeiter werden unterstützt."},
        {"score": 4, "text": "Kommunikation und Transparenz stehen im Vordergrund; Mitarbeiter werden gefördert und unterstützt."}
      ],
      "choice": -1
    },
    {
      "title": "Existiert Feedback-Kultur im Unternehmen?",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Keine Feedack Kultur vorhanden."},
        {"score": 1, "text": "Feedback Kultur nur selten in Verwendung."},
        {"score": 2, "text": "Feedback Kultur wird überdurschnittlich oft genutzt."},
        {"score": 3, "text": "Feedback Kultur wird begrüßt und in die Tat umgesetzt."},
        {"score": 4, "text": "Feedback Kultur ist fester Bestandteil und nicht mehr wegzudenken. Umsetzungen werden häufig und zügig gemacht."}
      ],
      "choice": -1
    },
    {
      "title": "Werden kontinuierliche, fachliche und technische Weiterentwicklungen angeboten?",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Es passiert keine fachliche oder technische Weiterentwicklung."},
        {"score": 1, "text": "Fachliche oder technische Weiterentwicklung findet sporadisch statt."},
        {"score": 2, "text": "Fachliche und technische Weiterentwicklung wird im Industrie Standard durchgeführt."},
        {"score": 3, "text": "Fachliche und Technische Weiterentwicklung wird oft überprüft und umgesetzt."},
        {"score": 4, "text": "Die fachliche und technische Umsetzung findet oft und auf dem aktuellsten Niveau statt."}
      ],
      "choice": -1
    }
  ],
  "strategy": [
    {
      "title": "Wie werden die Ziele der Projekte im Unternehmen abgestimmt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gehen keine klaren Ziele hervor. Immer andere Zielsetzung."},
        {"score": 1, "text": "Das primäre Ziel ist es die SW zu entwicklen und Projekt schnell abzuschließen."},
        {"score": 2, "text": "Das Ziel ist die vorher definierten Anforderungen gut zu treffen."},
        {"score": 3, "text": "Das Ziel ist gute SW Qualität und regelmäßige Zwischenstände."},
        {"score": 4, "text": "Das Ziel ist die SW in kleinen Inkrementen nach Kundenwunsch zu entwickeln. Nach jedem Inkrement werden neue Kundenwünsche berücksichtigt und in die SWE eingeflossen."}
      ],
      "choice": -1
    },
    {
      "title": "Werden individuelle Kundenbedürfnisse konstant berücksichtigt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es können keine Veränderungen berücksichtigt werden"},
        {"score": 1, "text": "Veränderungen werden nur bedingt berücksichtigt."},
        {"score": 2, "text": "Es gibt Prozesse für Veränderungen der Anforderungen, allerdings große Verschiebungen."},
        {"score": 3, "text": "Kundenfeedback werden stetig abgefragt, um Veränderungen mit aufzunehmen und einzupflegen."},
        {"score": 4, "text": "Der SWE Prozess ist auf kurze, optimierte Sprintdauer ausgelegt. Nach jedem Sprint -> Review und neue Inputs vom Kunden"}
      ],
      "choice": -1
    },
    {
      "title": "Wie werden die mitarbeitende Aufwandsabschätzung durchgeführt?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es wird keinerlei Aufwandsabschätzung durchgeführt."},
        {"score": 1, "text": "Jeder Entwickler schätzt für sich selbst ab."},
        {"score": 2, "text": "einzelne Teammitglieder führen Aufwandabschätzung der Aufgaben durch."},
        {"score": 3, "text": "Aufwandsabschätzung wird im gesamten Team durchgeführt und diskutiert."},
        {"score": 4, "text": "Aufwandsabschätzung ist regelmäßiger Teil vor Entwicklungszyklus (planning). Alle geplanten Aufgaben werden geschätzt."}
      ],
      "choice": -1
    },
    {
      "title": "Werden die persönliche Ziele für jeden Mitarbeiter klar abgesteck?",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es wird nicht über persönliche Ziele gesprochen."},
        {"score": 1, "text": "Mitarbeiter können bei Bedarf austausch über persönliche Ziele führen. Nicht vorgesehen."},
        {"score": 2, "text": "Es gibt vereinzelten Austausch zu persönlichen Zielen von Mitarbeitenden."},
        {"score": 3, "text": "Mitarbeiter führen in ihren Bereichen regelmäßige Gespräche zu Zielen."},
        {"score": 4, "text": "Mitarbeiter führen regelmäßige Gespräche zu persönlichen Zielen in allen möglichen Bereichen im Unternehmen (möglichkeit zum Wechsel)."}
      ]
    },
    {
      "title": "Wie ist die Zusammenarbeit mit Kunden gestalltet?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams haben eine enge Beziehung zu ihren Kunden aufgebaut und treten regelmäßig in Kontakt mit ihnen."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um die Anforderungen und Bedürfnisse der Kunden zu erfassen und in die Entwicklung einzubeziehen?"},
        {"score": 2, "text": "Feste Kundenkontaktpunkte und Feedback-Schleifen sind etabliert, um die enge Zusammenarbeit zu gewährleisten?"},
        {"score": 3, "text": "Regelmäßige Kunden-Demos und -Präsentationen werden durchgeführt, um das Feedback und die Zufriedenheit der Kunden zu messen."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um die enge Zusammenarbeit mit ihren Kunden zu verbessern und zu vertiefen."}
      ],
      "choice": -1
    },
    {
      "title": "Wie wird mit Kundenbedürfnisse und -befriedigungen umgegangen?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können die Bedürfnisse und Anforderungen ihrer Kunden genau erfassen und in ihre Entwicklungsarbeit einbeziehen."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um die Kundenbedürfnisse zu erfassen, zu priorisieren und zu verfolgen."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um die Kundenbedürfnisse und -befriedigung zu gewährleisten."},
        {"score": 3, "text": "Regelmäßige werden Kunden-Demos und -Präsentationen durchgeführt, um die Kundenbedürfnisse und -befriedigung zu überprüfen und zu verbessern."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um die Kundenbedürfnisse und -befriedigung zu optimieren und zu maximieren."}
      ],
      "choice": -1
    },
    {
      "title": "Wie erfolgt die Softwareauslieferung?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können häufig Softwareauslieferungen durchführen, ohne dabei die Qualität der Software zu beeinträchtigen."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um die Qualität und Integrität der Software während der häufigen Auslieferungen sicherzustellen."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um die frühen und häufigen Softwareauslieferungen zu ermöglichen und zu unterstützen."},
        {"score": 3, "text": "Regelmäßige Überprüfungen und Anpassungen der Prozesse und Arbeitsabläufe werden durchgeführt, um die frühen und häufigen Softwareauslieferungen zu verbessern und zu optimieren."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um die frühen und häufigen Softwareauslieferungen noch weiter zu beschleunigen und zu verbessern."}
      ],
      "choice": -1
    },
    {
      "title": "Wie reagiert Teams im Unternehmen, wenn Veränderungen im Projekt vorkommen?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können schnell und flexibel auf Veränderungen in ihren Anforderungen und Umgebungen reagieren."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um Veränderungen in Anforderungen und Umgebungen zu erkennen und zu verarbeiten."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um die Akzeptanz von Veränderungen zu fördern und zu unterstützen."},
        {"score": 3, "text": "Regelmäßige Retrospektiven werden durchgeführt, um die Fähigkeit des Teams, Veränderungen zu akzeptieren und darauf zu reagieren, zu verbessern."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um ihre Flexibilität und ihre Fähigkeit, auf Veränderungen zu reagieren, weiter zu verbessern."}
      ],
      "choice": -1
    },
    {
      "title": "Wie werden die Anforderungen und Funktionen implementiert, um den Nutzen für den Kunden zu maximieren?",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können sicherstellen, dass sie nur die wichtigsten und wertvollsten Anforderungen und Funktionen implementieren."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um die Priorisierung der Anforderungen und Funktionen zu unterstützen und sicherzustellen, dass nur die wichtigsten und wertvollsten implementiert werden."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um sicherzustellen, dass nur die Anforderungen und Funktionen implementiert werden, die tatsächlich einen Nutzen für den Kunden haben."},
        {"score": 3, "text": "Regelmäßige Kunden-Feedbacks und -Tests werden durchgeführt, um sicherzustellen, dass nur die wirklich wichtigen und wertvollen Anforderungen und Funktionen implementiert werden."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um sicherzustellen, dass sie nur die wirklich wichtigen und wertvollen Anforderungen und Funktionen implementieren und damit den Nutzen für den Kunden maximieren."}
      ],
      "choice": -1
    },
    {
      "title": "Wie sind die Erreichbarkeit der Informationen im Unternehmen?",
      "cite": "https://link.springer.com/chapter/10.1007/978-3-642-61101-8_11",
      "answers": [
        {"score": 0, "text": "Es gibt keine Informationen."},
        {"score": 1, "text": "Informationen sind schwer und nicht für jeden erreichbar."},
        {"score": 2, "text": "Informationen sind schwer aber für jeden erreichbar."},
        {"score": 3, "text": "Informationen sind schnell, unkompliziert aber nicht für jeden erreichbar."},
        {"score": 4, "text": "Informationen sind schnell, unkompliziert und für jeden erreichbar."}
      ],
      "choice": -1
    },
    {
      "title": "Wie wird Produktsqualität im Unternehmen gemessen?",
      "cite": "https://link.springer.com/chapter/10.1007/978-3-642-61101-8_11",
      "answers": [
        {"score": 0, "text": "Qualität der Produkte wird nicht gemessen."},
        {"score": 1, "text": "Qualität wird gemmessen, aber weder in Fehlerraten noch in Kundenzufriedenheit."},
        {"score": 2, "text": "Qualität wird nur in Fehlerraten gemessen."},
        {"score": 3, "text": "Qualität wird sowohl in Fehlerraten als auch in Kundenzufriedenheit oder nur kurz fristige Kundenzufriedenheit gemessen."},
        {"score": 4, "text": "Qualität wird in langfristiger Kundenzufriedenheit gemessen."}
      ],
      "choice": -1
    }
  ]
}
