{
  "processes": [
    {
      "title": "Wie flexibel ist Ihre Anforderungsaufnahme?",
      "shortTitle": "Flexibilität der Anforderungsaufnahme",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Anforderungen werden während des Projekts ad-hoc und ohne festgelegte Prozesse aufgenommen."},
        {"score": 1, "text": "Anforderungen werden während des Projekts nach einem festgelegten Verfahren aufgenommen, um sicherzustellen, dass alle relevanten Informationen berücksichtigt werden."},
        {"score": 2, "text": "Anforderungen werden während des Projekts nach einem festgelegten und dokumentierten Verfahren aufgenommen, um sicherzustellen, dass alle Beteiligten dasselbe Verständnis davon haben, wie Anforderungen aufgenommen werden."},
        {"score": 3, "text": "Anforderungen werden während des Projekts nach einem festgelegten und bewährten Verfahren aufgenommen, das im Team gut verstanden und angewendet wird."},
        {"score": 4, "text": "Anforderungen werden während des Projekts nach einem festgelegten und ständig verbesserten Verfahren aufgenommen, welches das Projektziel unterstützt und die Zufriedenheit des Kunden sicherstellt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Finden in den Teams tägliche, kurze Besprechung zur Entwicklung (Dailys) statt?",
      "shortTitle": "Tägliche Entwicklungsdailys in Teams",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es findet kaum Austausch im Entwicklerteam statt (jeder Arbeitet für sich an seinen Aufgaben)."},
        {"score": 1, "text": "Das gesamte Entwicklerteam hat die Möglichkeit sich untereinander abzustimmen."},
        {"score": 2, "text": "Es gibt einen festgelegten Rahmen zur regelmäßigen Besprechung (bspw. wöchentlich)."},
        {"score": 3, "text": "Es finden jeden Tag zu festgelegter Uhrzeit im kompletten Team Dailys statt."},
        {"score": 4, "text": "Es finden jeden Tag zu festgelegter Uhrzeit im  Team Dailys statt. Es wird auf eine kurze Dauer und Effektivität geachtet."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie stark ist das Testen der Software im Entwicklungsprozess integriert?",
      "shortTitle": "Testintegrationsgrad in Softwareentwicklung",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Neue Features, sowie die allgemeine Funktion der Software werden nicht getestet."},
        {"score": 1, "text": "Neue Features sowie allgemeine Funktionen werden hin und wieder überprüft."},
        {"score": 2, "text": "Es gibt klare Vorgaben zu Softwaretests, welche von einem Testteam berücksichtigt werden."},
        {"score": 3, "text": "Die Verantwortung der Softwaretests liegt im gesamten Entwicklerteam. Jeder befolgt klare Vorgaben."},
        {"score": 4, "text": "Das gesamte Entwicklerteam sorgt für regelmäßiges und zeitnahes Testen vor der Auslieferung einer Funktion."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie lässt sich die Übersicht der aktuellen Tasks im Team beschreiben?",
      "shortTitle": "Task-Übersicht in Teams",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Übersicht wer an was entwickelt."},
        {"score": 1, "text": "Die Entwickler tauschen sich unregelmäßig aus wer an was arbeitet."},
        {"score": 2, "text": "Die Entwickler tauschen sich regelmäßig aus wer an was arbeitet."},
        {"score": 3, "text": "Die Entwickler haben eine konkrete Übersicht der Tasks und aktualisieren wer was bearbeitet."},
        {"score": 4, "text": "Die Entwickler haben eine detaillierte Übersicht der Tasks und verschiedene Status der Bearbeitung, welche stetig aktualisiert werden."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie sehr sind die Stakeholder durch Demonstrationen des Softwarestandes im Entwicklungsprozess involviert?",
      "shortTitle": "Stakeholder-Einbindung in Software-Demonstrationen",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Die Software wird am Ende ausgeliefert und nicht extra demonstriert."},
        {"score": 1, "text": "Die Software wird am Ende ausgeliefert und sorgfältig demonstriert."},
        {"score": 2, "text": "Die Software wird auf Anfrage dem Kunden auch während der Entwicklungsphase demonstriert."},
        {"score": 3, "text": "Die Software wird regelmäßig (festgelegt) dem Kunden demonstriert."},
        {"score": 4, "text": "Die Software wird regelmäßig allen Stakeholdern (inkl. allen Entwicklern) demonstriert und Feedback wird eingeholt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie häufig wird bestehender Code im Laufe des Projekts überarbeitet und verbessert?",
      "shortTitle": "Häufigkeit von Code-Refactoring",
      "cite": "https://link.springer.com/book/10.1007/978-3-658-33395-9",
      "answers": [
        {"score": 0, "text": "Der Quellcode und dessen Dokumentation werden nicht überarbeitet."},
        {"score": 1, "text": "Der Quellcode und dessen Dokumentation werden teilweise und selten überarbeitet."},
        {"score": 2, "text": "Der Quellcode und dessen Dokumentation werden regelmäßig von bestimmten Mitarbeitern überarbeitet."},
        {"score": 3, "text": "Der Quellcode und dessen Dokumentation werden regelmäßig von den jeweiligen Entwicklern evaluiert und selbstständig überarbeitet."},
        {"score": 4, "text": "Der Quellcode und dessen Dokumentation werden regelmäßig von den jeweiligen Entwicklern evaluiert und nach Diskussionen im Entwicklerteam überarbeitet."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Existiert eine priorisierte Übersicht aller Produktanforderungen/Entwicklungsaufgaben?",
      "shortTitle": "Priorisierte Übersicht für Produktanforderungen/Entwicklungsaufgaben",
      "cite": "https://link.springer.com/book/10.1007/978-3-658-33395-9",
      "answers": [
        {"score": 0, "text": "Es gibt eine unpriorisierte Übersicht aller Kundenanforderungen. Diese werden nicht in technische Aufgaben formuliert. Entwickler arbeiten drauf los."},
        {"score": 1, "text": "Die Kundenanforderungen werden zu Beginn in konkrete Entwicklungsaufgaben überführt (Übersicht vorhanden)."},
        {"score": 2, "text": "Die Aufgaben werden regelmäßig von/mit Entwicklern in Aufgaben formuliert."},
        {"score": 3, "text": "Es gibt einen Product Owner, der die Aufgaben in Absprache mit den Entwicklern pflegt und die Übersicht aktuell hält und priorisiert."},
        {"score": 4, "text": "Es gibt einen Product Owner, der die Aufgaben täglich pflegt, kategorisiert, priorisiert und mit Entwicklern abstimmt. Es finden regelmäßige Anpassungen und Diskussionen statt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden Kick-Off-Workshops zum Sammeln der Anforderung (alle Stakeholder) durchgeführt?",
      "shortTitle": "Kick-Off-Workshops zur Anforderungssammlung",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Es findet keinerlei interaktiver Kundenaustausch zu Anforderungen statt."},
        {"score": 1, "text": "Die Anforderungen kommen vom Kunden und werden teilweise zur Diskussion gestellt (hin-und-her Kommunikation)."},
        {"score": 2, "text": "Ausgewählte Personen des Projekts führen einen Austausch mit Kunden zu Anforderungen durch."},
        {"score": 3, "text": "Zu Beginn findet ein Workshop aller Beteiligten statt, um die Anforderungen vollständig festzulegen."},
        {"score": 4, "text": "Zu Beginn findet mit allen Stakeholdern ein Workshop statt. Dabei werden Ergebnisse festgehalten, jedoch ist man für grundlegende Veränderungen offen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wird neuer Code durch andere Entwickler überprüft und validiert?",
      "shortTitle": "Code-Review durch andere Entwickler",
      "cite": "https://link.springer.com/book/10.1007/978-3-658-33395-9",
      "answers": [
        {"score": 0, "text": "Neue Codeabschnitte und alle Codeänderungen werden nicht überprüft."},
        {"score": 1, "text": "Neue Codeabschnitte und alle Codeänderunen werden selten überprüft."},
        {"score": 2, "text": "Neue Codeabschnitte und alle Codeänderungen werden regelmäßig überprüft."},
        {"score": 3, "text": "Neue Codeabschnitte und alle Codeänderungen werden mindestens durch eine Person und regelmäßig überprüft."},
        {"score": 4, "text": "Neue Codeabschnitte und alle Codeänderungen werden mindestens durch eine qualifizierte Person und regelmäßig überprüft."}
      ],
      "choice": -1,
      "boosted": false
    }
  ],
  "organisation": [
    {
      "title": "Wird ein Agile Transition Team gewinnbringend eingesetzt?",
      "shortTitle": "Effektiver Einsatz eines Agile Transition Teams",
      "cite": "Schwaber, K., & Beedle, M. (2002). Agile Software Development with Scrum. Prentice Hall",
      "answers": [
        {"score": 0, "text": "Es gibt ein dediziertes Team, das sich ausschließlich mit der Einführung agiler Methoden und Prozesse im Unternehmen befasst."},
        {"score": 1, "text": "Das Unternehmen/Abteilung verfügt über ein Team, welches sich mit der Einführung und Umsetzung agiler Methoden und Prozesse befasst, und  zudem klare Ziele und Verantwortlichkeiten hat."},
        {"score": 2, "text": "Die Ziele und Verantwortlichkeiten des Agile Transition Teams sind im Unternehmen festgelegt und dokumentiert und werden regelmäßig überprüft und gegebenenfalls angepasst."},
        {"score": 3, "text": "Das Agile Transition Team ist im Unternehmen gut ausgebildet, erfahren und kann daher die Einführung agiler Methoden und Prozesse erfolgreich vorantreiben und Schwierigkeiten schnell und effektiv lösen."},
        {"score": 4, "text": "Das Agile Transition Team führt im Unternehmen regelmäßige Retrospektiven durch, um die Einführung agiler Methoden und Prozesse kontinuierlich zu verbessern und zu optimieren."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wird ein Agile Coach in der Abteilung gewinnbringend eingesetzt?",
      "shortTitle": "Effektiver Einsatz eines Agile Coaches in Abteilung",
      "cite": "Highsmith, J. (2002). Agile Software Development Ecosystems. Addison-Wesley",
      "answers": [
        {"score": 0, "text": "Das Unternehmen/Abteilung verfügt über einen dedizierten Agile Coach, der das Unternehmen bei der Einführung agiler Methoden und Prozesse unterstützt."},
        {"score": 1, "text": "Das Unternehmen verfügt über einen Agile Coach, der das Unternehmen bei der Einführung und Umsetzung agiler Methoden und Prozesse unterstützt und  zudem klare Ziele und Verantwortlichkeiten hat."},
        {"score": 2, "text": "Die Ziele und Verantwortlichkeiten des Agile Coaches sind im Unternehmen festgelegt und dokumentiert und werden regelmäßig überprüft und gegebenenfalls angepasst."},
        {"score": 3, "text": "Der Agile Coach ist im Unternehmen gut ausgebildet und erfahren und kann daher das Unternehmen erfolgreich bei der Einführung agiler Methoden und Prozesse unterstützen und Schwierigkeiten schnell und effektiv lösen."},
        {"score": 4, "text": "Der Agile Coach führt im Unternehmen regelmäßige Retrospektiven durch, um die Einführung agiler Methoden und Prozesse kontinuierlich zu verbessern und zu optimieren."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden Rollen in Projekten klar definiert?",
      "shortTitle": "Klare Definition von Rollen",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt kein klar abgrenzbares Entwicklerteam."},
        {"score": 1, "text": "Das Projektteam besteht aus definierten Personen, allerdings keine klaren Rollen wo jeder alles macht."},
        {"score": 2, "text": "Das Projektteam besteht aus definierten Personen, einige haben ein Spezialgebiet."},
        {"score": 3, "text": "Das Projektteam besteht aus klaren Rollen, welche nicht vollständig besetzt/eingehalten werden."},
        {"score": 4, "text": "Das Team besteht aus klaren Rollen, jede Rolle ist ausreichend besetzt und vertretbar, niemand muss springen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden User Stories ausformuliert?",
      "shortTitle": "Ausformulierung von User Stories",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "User Stories werden nicht oder nur sporadisch benutzt."},
        {"score": 1, "text": "User Stories werden genutzt, enthalten aber nur grobe Anforderungen."},
        {"score": 2, "text": "User Stories sind detaillierter und enthalten spezifische Anforderungen zum Produkt."},
        {"score": 3, "text": "User Stories werden regelmäßig erstellt und überprüft, um die Qualität sicherzustellen."},
        {"score": 4, "text": "User Stories sind umfassend und ausreichend geprüft und dienen zur Kommunikation und Planung gemeinsam mit dem Kunden."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie wird die Mitarbeiter-Aufwandsabschätzung durchgeführt?",
      "shortTitle": "Vorgehensweise bei Mitarbeiter-Aufwandsabschätzung",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es wird keinerlei Aufwandsabschätzung durchgeführt."},
        {"score": 1, "text": "Jeder Entwickler schätzt für sich selbst ab."},
        {"score": 2, "text": "Einzelne Teammitglieder führen eine Aufwandsabschätzung der Aufgaben durch."},
        {"score": 3, "text": "Eine Aufwandsabschätzung wird im gesamten Team durchgeführt und diskutiert. "},
        {"score": 4, "text": "Eine Aufwandsabschätzung ist ein regelmäßiger Teil vor dem Entwicklungszyklus (planning). Alle geplanten Aufgaben werden geschätzt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Existieren bereichsübergreifende Teams (z.B. aus Devs, Designern, Business, etc.)?",
      "shortTitle": "Bereichsübergreifende Teams",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Das Projektteam hat keine klaren Bereichsdefinitionen. Einzelne Personen arbeiten interdisziplinär."},
        {"score": 1, "text": "Das Team besteht hauptsächlich aus Entwicklern, andere Bereiche arbeiten ihm zu."},
        {"score": 2, "text": "Das Team besteht hauptsächlich aus Entwicklern, bestimmte Spezialisten stehen zur Verfügung."},
        {"score": 3, "text": "Das Team besteht aus interdisziplinären Teilen (Devs, Designer,…). Es werden vereinzelt Spezialisten herangezogen."},
        {"score": 4, "text": "Das Team besteht vollständig aus interdisziplinären Teilen (es wird alles abgedeckt)."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wird das Prinzip des Pair-Programmings angewendet?",
      "shortTitle": "Pair-Programming Anwendung",
      "cite": ["https://link.springer.com/book/10.1007/978-3-658-33395-9", "https://mediatum.ub.tum.de/doc/1094277/file.pdf"],
      "answers": [
        {"score": 0, "text": "Die Programmierer arbeiten allein und somit findet kein Pair-Programming statt."},
        {"score": 1, "text": "Das Pair-Programming wird nur für neue Mitarbeiter angewendet."},
        {"score": 2, "text": "Die Programmierer arbeiten hauptsächlich allein. Bei den schwierigen Aufgaben wenden sich die Mitarbeiter gelegentlich an den Experten für ein Pair-Programming."},
        {"score": 3, "text": "Das Pair-Programming findet regelmäßig mit festen Terminen zwischen zwei Team-Mitgliedern statt."},
        {"score": 4, "text": "Mindestens zwei Team-Mitglieder arbeiten eng zusammen und tauschen öfter beim Pair-Programming ihr Wissen aus."}
      ],
      "choice": -1,
      "boosted": false
    }
  ],
  "technology": [
    {
      "title": "Werden Aufgabenmanagementtools für die effektive Entwicklung verwendet?",
      "shortTitle": "Effektive Entwicklung mit Aufgabenmanagementtools",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Es werden keine Aufgabenmanagmenttools benutzt."},
        {"score": 1, "text": "Aufgabenmanagmenttools werden nur selten von wenigen Mitarbeitern benutzt."},
        {"score": 2, "text": "Aufgabenmanagmenttools werden ohne einheitliche Struktur für die Aufgabenverteilung benutzt."},
        {"score": 3, "text": "Aufgabenmanagmenttools werden mit einheitlicher Struktur ausschließlich für die Aufgabenverteilung genutzt."},
        {"score": 4, "text": "Aufgabenmanagmenttools werden für die effektive Entwicklung genutzt und es werden Auswertungsstatistiken zur Optimierung herangezogen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden Tools(z. B Videokonferenz-Tools, Chat-Tools, Datenmanagement-Tools, Projektmanagement, Events- und Umfragen-Tools, virtuelles Lern- und Tutorials-Tools) zur Verbesserung der Homeofficeanbindung verwendet?",
      "shortTitle": "Verbesserung der Homeoffice-Anbindung über Tools",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Es werden keine Tools verwendet. Die Mitarbeiter im Homeoffice arbeiten komplett autark."},
        {"score": 1, "text": "Einzelne Mitarbeiter im Homeoffice benutzen Tools nur in Notfallsituationen."},
        {"score": 2, "text": "Alle Mitarbeiter im Homeoffice und im Büro benutzen Tools, aber nur in Problemsituationen."},
        {"score": 3, "text": "Alle Mitarbeiter im Homeoffice und im Büro benutzen Tools regelmäßig."},
        {"score": 4, "text": "Alle Mitarbeiter im Homeoffice und im Büro benutzen eine Variation von Tools. Die effektive Benutzung dieser Tools wird durch z. B. Schulungen oder Tutorials sichergestellt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden Zeiterfassungstools verwendet, um den Entwicklungsprozess zu beobachten?",
      "shortTitle": "Beobachtung des Entwicklungsprozesses mit Zeiterfassungstools",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Es werden keine Zeiterfassungstools genutzt."},
        {"score": 1, "text": "Es werden Zeiterfassungstools regelmäßig und zielgerichtet genutzt."},
        {"score": 2, "text": "Es werden Zeiterfassungstools standardisiert und in allen Projekten eingesetzt."},
        {"score": 3, "text": "Es werden Zeiterfassungstools effektiv und effizient genutzt, um die Entwicklung zu optimieren und zu verbessern."},
        {"score": 4, "text": "Es werden Zeiterfassungstools kontinuierlich weiterentwickelt und angepasst, um die besten Ergebnisse zu erzielen."}
      ],
      "choice": -1,
      "boosted": false
    }
  ],
  "skills_culture": [
    {
      "title": "Gibt es ein gemeinsam festgelegtes agiles Mindset?",
      "shortTitle": "Gemeinsam festgelegtes Mindset",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Es gibt kein Verständnis vom agilen Arbeiten."},
        {"score": 1, "text": "Es gibt viele verschiedene Auslegungen eines agilen Mindsets, jedoch kein gemeinsames. "},
        {"score": 2, "text": "Es gibt ein gemeinsames agiles Mindset, welches nicht festgelegt ist."},
        {"score": 3, "text": "Es gibt eine festgelegte Form eines agilen Mindsets, welches von den meisten Mitarbeitern übernommen wird."},
        {"score": 4, "text": "Es gibt eine festgelegte Form eines agilen Mindsets, das regelmäßig aktualisiert und an alle Mitarbeiter herangetragen wird."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden die Probleme und Konflikte in den Projektteams diskutiert?",
      "shortTitle": "Diskussion von Problemen/Konflikten in Projektteams",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Struktur zur Problembesprechung."},
        {"score": 1, "text": "Probleme können offen geäußert werden."},
        {"score": 2, "text": "Probleme können offen geäußert werden. Es gibt Abläufe zur Berücksichtigung dieser."},
        {"score": 3, "text": "Es gibt im Projektteam eine ausgewiesene Person zur Besprechung von Konflikten im Team."},
        {"score": 4, "text": "Es finden regelmäßige Retrospektiven zur Besprechung von Abläufen, Konflikten und dem Entwicklungsprozess statt, welche von einem unabhängigem moderiert."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Stehen Weiterbildungsmöglichkeiten für die Mitarbeiter zur Verfügung?",
      "shortTitle": "Weiterbildungsmöglichkeiten für Mitarbeiter",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gibt keine Möglichkeiten zur Weiterbildung."},
        {"score": 1, "text": "Mitarbeiter müssen sich selbst um Weiterbildungsoptionen kümmern."},
        {"score": 2, "text": "Vereinzelt werden Weiterbildungen für Mitarbeiter angeboten."},
        {"score": 3, "text": "Mitarbeiter haben in ihren Bereichen Weiterbildungsoptionen."},
        {"score": 4, "text": "Jeder Mitarbeiter hat eine stetig wachsende Auswahl an Möglichkeiten, sich in allen Bereichen weiterzubilden."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie wird die Arbeitsgeschwindigkeit im Unternehmen geregelt?",
      "shortTitle": "Regulierung der Arbeitsgeschwindigkeit",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können ihre Arbeitsgeschwindigkeit durchgängig und stabil halten."},
        {"score": 1, "text": "Ressourcen und Kapazitäten werden im Team gut geplant und eingesetzt, um die Arbeitsgeschwindigkeit zu stabilisieren."},
        {"score": 2, "text": "Prozesse und Arbeitsabläufe sind im Team etabliert und dokumentiert, um eine konstante Arbeitsgeschwindigkeit zu ermöglichen."},
        {"score": 3, "text": "Regelmäßig werden Retrospektiven durchgeführt, um Schwankungen in der Arbeitsgeschwindigkeit zu identifizieren und zu beheben."},
        {"score": 4, "text": "Teams führen kontinuierliche Experimente und Anpassungen an ihren Prozessen und Arbeitsabläufen durch, um eine konstante Arbeitsgeschwindigkeit beizubehalten."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie wird die Aufgabenverteilung der Teams auf Projektebene geregelt?",
      "shortTitle": "Aufgabenverteilung der Teams auf Projektebene",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Führungskräfte weisen den Projektmitarbeitern Aufgaben zu und priorisieren diese selbstständig, ohne Absprache im Team."},
        {"score": 1, "text": "Führungskräfte weisen den Projektmitarbeitern Aufgaben zu und priorisieren diese selbstständig. Bei Bedarf besteht Diskussionsoffenheit."},
        {"score": 2, "text": "Führungskräfte weisen den Projektmitarbeitern nach Absprache Aufgaben zu."},
        {"score": 3, "text": "Die Teammitarbeiter weisen sich selbstständig Ihre bevorzugten Aufgaben zu."},
        {"score": 4, "text": "Es finden regelmäßige Aufgabenbesprechungen statt, nach denen die Mitarbeiter selbstständig die Aufgaben umkoordinieren, um eine möglichst hohe Effektivität zu erreichen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Kommunizieren Mitarbeiter offen und werden durch eine Führungskraft unterstützt und gefördert?",
      "shortTitle": "Offene Kommunikation der Mitarbeiter",
      "cite": "https://cs.emis.de/LNI/Proceedings/Proceedings263/161.pdf",
      "answers": [
        {"score": 0, "text": "Es findet keine Kommunikation zwischen Mitarbeitern und Führungskräften statt."},
        {"score": 1, "text": "Es findet nur die nötigste Kommunikation zwischen Mitarbeitern und Führungskräften statt."},
        {"score": 2, "text": "Die Kommunikation zwischen Mitarbeitern und Führungskräften findet in normalem Maße statt."},
        {"score": 3, "text": "Die Kommunikation zwischen Mitarbeitern und Führungskräften  findet in normalem Maße statt und wird auf Augenhöhe geführt. Die Mitarbeiter werden dabei unterstützt."},
        {"score": 4, "text": "Kommunikation und Transparenz stehen im Vordergrund, während  häufige Mitarbeitergespräche auf Augenhöhe geführt werden. Mitarbeiter werden gefördert und unterstützt."}
      ],
      "choice": -1,
      "boosted": false
    }
  ],
  "strategy": [
    {
      "title": "Wie werden die Ziele der Projekte im Unternehmen abgestimmt?",
      "shortTitle": "Abstimmung der Projektziele",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es gehen keine klaren Ziele hervor. Es gibt immer eine andere Zielsetzung."},
        {"score": 1, "text": "Das primäre Ziel ist es, die Software zu entwickeln und das Projekt schnell abzuschließen."},
        {"score": 2, "text": "Das Ziel ist die vorher definierten Anforderungen gut zu treffen."},
        {"score": 3, "text": "Das Ziel ist eine gute Software-Qualität und dabei regelmäßige Zwischenstände zu haben."},
        {"score": 4, "text": "Das Ziel ist die Software in kleinen Inkrementen nach Kundenwunsch zu entwickeln. Nach jedem Inkrement werden neue Kundenwünsche berücksichtigt und in die Softwareentwicklung eingeflossen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie werden Unternehmensziele in Projektteams formuliert und zusammengeführt?",
      "shortTitle": "Formulierung und Zusammenführung der Unternehmensziele",
      "cite": "Eigene Arbeit",
      "answers": [
        {"score": 0, "text": "Unternehmensziele werden außerhalb des Projektteams bestimmt."},
        {"score": 1, "text": "Die Unternehmensziele werden außerhalb definiert, jeder hat einen guten Überblick und kann Kritik üben."},
        {"score": 2, "text": "Die Unternehmensziele werden mit Projektteams besprochen und es gibt Diskussionen darüber."},
        {"score": 3, "text": "Die Unternehmensziele werden zusammen mit den Projektteams formuliert."},
        {"score": 4, "text": "Unternehmensziele werden ausschließlich in Projektteams formuliert und zusammengeführt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden individuelle Kundenbedürfnisse konstant berücksichtigt?",
      "shortTitle": "Konstante Berücksichtigung der Kundenbedürfnisse",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es können keine Veränderungen berücksichtigt werden."},
        {"score": 1, "text": "Veränderungen werden nur bedingt berücksichtigt."},
        {"score": 2, "text": "Es gibt Prozesse für Veränderungen der Anforderungen, allerdings sind diese meist mit großen Verschiebungen verknüpft."},
        {"score": 3, "text": "Kundenfeedback werden stetig abgefragt, um Veränderungen mit aufzunehmen und einzupflegen."},
        {"score": 4, "text": "Der Softwareentwicklungsprozess  ist auf kurze, optimierte Sprintdauer ausgelegt. Nach jedem Sprint gibt es ein Review und neue Inputs vom Kunden werden miteinbezogen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Werden die persönlichen Ziele für jeden Mitarbeiter klar abgesteckt?",
      "shortTitle": "Festlegung der persönlichen Ziele der Mitarbeiter",
      "cite": "https://link.springer.com/content/pdf/10.1007/s11612-020-00522-0.pdf",
      "answers": [
        {"score": 0, "text": "Es wird nicht über persönliche Ziele gesprochen."},
        {"score": 1, "text": "Mitarbeiter können bei Bedarf einen Austausch über persönliche Ziele führen."},
        {"score": 2, "text": "Es gibt vereinzelten Austausch zu persönlichen Zielen von Mitarbeitenden."},
        {"score": 3, "text": "Mitarbeiter führen in ihren Bereichen regelmäßige Gespräche zu persönlichen Zielen."},
        {"score": 4, "text": "Mitarbeiter führen regelmäßige Gespräche zu persönlichen Zielen in allen möglichen Bereichen im Unternehmen (Bereichswechsel innerhalb des Unternehmens besteht)."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie ist die Zusammenarbeit mit Kunden gestaltet?",
      "shortTitle": "Zusammenarbeit mit Kunden",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams haben eine enge Beziehung zu ihren Kunden aufgebaut und treten regelmäßig in Kontakt mit ihnen."},
        {"score": 1, "text": "Spezifische Mechanismen werden genutzt, um die Anforderungen und Bedürfnisse der Kunden zu erfassen und in die Entwicklung einzubeziehen?"},
        {"score": 2, "text": "Feste Kundenkontaktpunkte und Feedback-Schleifen sind etabliert, um die enge Zusammenarbeit zu gewährleisten?"},
        {"score": 3, "text": "Regelmäßige Kunden-Demos und -Präsentationen werden durchgeführt, um das Feedback und die Zufriedenheit der Kunden zu messen."},
        {"score": 4, "text": "Teams nutzen fortschrittliche Technologien und Methoden, um die enge Zusammenarbeit mit ihren Kunden zu verbessern und zu vertiefen."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie wird mit Kundenbedürfnissen umgegangen?",
      "shortTitle": "Umgang mit Kundenbedürfnissen",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können die Bedürfnisse und Anforderungen ihrer Kunden nicht erfassen."},
        {"score": 1, "text": "Teams erfassen die Bedürfnisse der Kunden aber hinterfragen und diskutieren diese nicht."},
        {"score": 2, "text": "Spezifische Mechanismen werden genutzt, um die Kundenbedürfnisse zu erfassen, zu priorisieren und auch zu diskutieren."},
        {"score": 3, "text": "Spezifische Mechanismen zum Erfassen, Priorisieren und Diskutieren sind ausreichend dokumentiert und in den Teams etabliert."},
        {"score": 4, "text": "Spezifische Mechanismen zum Erfassen, Priorisieren und Diskutieren sind ausreichend dokumentiert und in den Teams etabliert. Zusätzlich werden Kunden-Demos und -Präsentationen regelmäßig durchgeführt."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie reagieren Teams im Unternehmen, wenn Veränderungen im Projekt vorkommen?",
      "shortTitle": "Reaktion der Teams auf Projektveränderungen",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können nicht schnell und flexibel auf Veränderungen in ihren Anforderungen und Umgebungen reagieren."},
        {"score": 1, "text": "Teams können je nach Maß geringfügig auf Veränderungen in ihren Anforderungen und Umgebungen reagieren."},
        {"score": 2, "text": "Spezifische Mechanismen werden genutzt, um Veränderungen in Anforderungen und Umgebungen zu erkennen und zu verarbeiten."},
        {"score": 3, "text": "Spezifische Mechanismen sind im Team etabliert und dokumentiert, um die Akzeptanz von Veränderungen zu fördern und zu unterstützen."},
        {"score": 4, "text": "Spezifische Mechanismen und zusätzlich regelmäßige Retrospektiven werden durchgeführt, um die Fähigkeit des Teams, Veränderungen zu akzeptieren und darauf zu reagieren, zu verbessern."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie werden die Anforderungen und Funktionen implementiert, um den Nutzen für den Kunden zu maximieren?",
      "shortTitle": "Implementierung der Anforderungen und Funktionen",
      "cite": "https://t73f.de/hochschule/thesis/2016_philipp.pdf, Kapitel 2.6",
      "answers": [
        {"score": 0, "text": "Teams können nicht sicherstellen, dass sie nur die wichtigsten und wertvollsten Anforderungen und Funktionen implementieren."},
        {"score": 1, "text": "Teams können nicht vollumfänglich sicherstellen, dass sie nur die wichtigsten und wertvollsten Anforderungen und Funktionen implementieren."},
        {"score": 2, "text": "Spezifische Mechanismen werden genutzt, um die Priorisierung der Anforderungen und Funktionen zu unterstützen und sicherzustellen, dass nur die wichtigsten und wertvollsten implementiert werden."},
        {"score": 3, "text": "Spezifische Mechanismen sind im Team etabliert und dokumentiert, um sicherzustellen, dass nur die Anforderungen und Funktionen implementiert werden, die tatsächlich einen Nutzen für den Kunden haben."},
        {"score": 4, "text": "Spezifische Mechanismen und regelmäßige Kunden-Feedbacks/-Tests werden durchgeführt, um sicherzustellen, dass nur die wirklich wichtigen und wertvollen Anforderungen und Funktionen implementiert werden."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie ist die Erreichbarkeit der projektspezifischen Informationen (Anforderungen, Termine, Deadlines, Ansprechpartner, etc.) im Unternehmen?",
      "shortTitle": "Erreichbarkeit projektspezifischer Informationen",
      "cite": "https://link.springer.com/chapter/10.1007/978-3-642-61101-8_11",
      "answers": [
        {"score": 0, "text": "Es gibt keine Möglichkeit für Projektmitarbeiter auf Informationen zuzugreifen."},
        {"score": 1, "text": "Informationen sind für einzelne Projektmitarbeiter schwer zu erreichen. Nur bestimmte Leute im Unternehmen haben Zugriff."},
        {"score": 2, "text": "Informationen sind schwer aber für jeden Mitarbeiter erreichbar."},
        {"score": 3, "text": "Informationen sind schnell, unkompliziert, aber nicht für jeden Mitarbeiter erreichbar."},
        {"score": 4, "text": "Informationen sind schnell, unkompliziert und für jeden Mitarbeiter erreichbar."}
      ],
      "choice": -1,
      "boosted": false
    },
    {
      "title": "Wie wird Produktqualität im Unternehmen gemessen?",
      "shortTitle": "Messung der Produktqualität",
      "cite": "https://link.springer.com/chapter/10.1007/978-3-642-61101-8_11",
      "answers": [
        {"score": 0, "text": "Die Qualität der Produkte wird nicht gemessen."},
        {"score": 1, "text": "Die Qualität wird gemessen, aber weder in Fehlerraten noch in Kundenzufriedenheit."},
        {"score": 2, "text": "Die Qualität wird nur in Fehlerraten gemessen."},
        {"score": 3, "text": "Die Qualität wird sowohl in Fehlerraten als auch in Kundenzufriedenheit oder nur kurzfristige Kundenzufriedenheit gemessen."},
        {"score": 4, "text": "Die Qualität wird in langfristiger Kundenzufriedenheit gemessen."}
      ],
      "choice": -1,
      "boosted": false
    }
  ]
}
